#include <iostream>
#include <clocale>

using namespace std;


/*
    Условие:
    Въвежда се цяло число N – брой ученици (1 ≤ N ≤ 30). За всеки ученик се въвежда
    оценка (цяло число от 2 до 6). Невалидните оценки не се вземат предвид.
    Програмата трябва:
    - да намери броя на валидните оценки
    - да изчисли средния успех
    - да преброи отличните оценки (6)
    - да преброи слабите оценки (2)
    - да определи дали има повече отлични или повече слаби оценки
    
    Примерен вход:
    8
    6 5 2 7 6 3 1 2

    Примерен изход:
    Брой валидни оценки: 6
    Среден успех: 4.00
    Брой отлични оценки: 2
    Брой слаби оценки: 2
    Отличните и слабите оценки са равен брой
*/

int main() {

    setlocale(LC_ALL, "");
    cout << "Брой на оценките: " << endl;
    int N; cin >> N;
    int grade, sum = 0, valid = 0, excellent = 0, weak = 0;
    
    for (int i = 0; i < N && i <= 30; i++) {
        cout << "Оценката # " << i << endl;
        cin >> grade;
        
        if (grade >= 2 && grade <= 6) {
            valid++;
            sum += grade;

            if (grade == 6) excellent++;
            else if (grade == 2) weak++;
        }
    }

    if (valid == 0) {
        cout << "Няма валидни оценки";
    } else {
        cout << "Брой валидни оценки: " << valid << endl;
        cout << "Среден успех: " << (double)sum / valid << endl;
        cout << "Брой отлични оценки: " << excellent << endl;
        cout << "Брой слаби оценки: " << weak << endl;
        if (excellent > weak) 
            cout << "Повече отлични оценки";
        else if (weak > excellent)
            cout << "Повече слаби оценки";
        else
            cout << "Отличните и слабите оценки са равен брой";
    }
    return 0;
}
